Merge branch 'main' of github.com:fabceolin/the_edge_agent
